<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 3 to add, 0 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.api will be created
  + resource "google_artifact_registry_repository" "api" {
      + create_time      = (known after apply)
      + effective_labels = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + labels           = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + location         = "europe-west1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "dungeon-studio-genshin-dev"
      + registry_uri     = (known after apply)
      + repository_id    = "api"
      + terraform_labels = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # google_project_service.artifactregistry will be created
  + resource "google_project_service" "artifactregistry" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dungeon-studio-genshin-dev"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.cloudrun will be created
  + resource "google_project_service" "cloudrun" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dungeon-studio-genshin-dev"
      + service            = "run.googleapis.com"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_artifact_repository_id = (known after apply)

```
</details>